{
    "home": {
        "subtitle": "Frontend Developer",
        "description": "Transformo ideas en interfaces claras y efectivas",
        "btnProjects": "Ver Proyectos",
        "btnContact": "Contacto"
    },
    "about": {
        "title": "Sobre mí",
        "description": "Soy Martín Salvador un amante de la programación. Comencé a estudiar de forma autodidacta y como un pasatiempo la manera de hacer páginas web y poco a poco fui adquiriendo más conocimientos hasta que me decidí a dedicarme a esto. Tengo certificados de varios cursos y botcamps con conociemientos avanzados en React, HMTL5, CSS3, JavaScript, SQL, GitHub y Figma . Cuento con las herramientas necesarias para crear paginas y aplicaciones web responsivas para lo que usted desee. No dude en consultarme, si usted tiene una idea yo se la hago realidad."
    },
    "nav": {
        "home": "Inicio",
        "about": "Sobre mí",
        "projects": "Experiencia",
        "studies": "Estudios",
        "contact": "Contacto"
    },
    "studies": {
        "title": "Estudios"
    },
    "contact": {
        "title": "Contacto"
    },
    "social":{
        "title": "Redes"
    },
    "contactForm": {
        "name": "Nombre",
        "email": "Correo Electrónico",
        "message": "Mensaje",
        "send": "Enviar"
    },
    "experience": {
        "subtitle1": "Projectos con empresas",
        "subtitle2": "Proyectos de cursos y bootcamps",
        "boton": "Abrir",
        "fiambreria": "Página corporativa",
        "Empresa": "Empresa",
        "administrador": "Administrador de Tareas",
        "troqueles": "Biblioteca de Troqueles",
        "glosario": "Glosario de alemán",
        "numerosecreto": "Número Secreto",
        "encriptador": "Encriptador de textos",
        "ppt": "Piedra, Papel o tijeras",
        "org": "Organizador de Roles",
        "company": "Empresa",
        "descriptionFiambreria": "Sitio web para un local de charcutería artesanal. El dueño quería una página sencilla con un Home donde se resuma un poco información sobre ellos, algunas imágenes del local, la ubicación con googlemaps y por sobre todo botones y enlaces que lleven al Whatsapp e Instagram. A su vez una sección de contacto donde esten disponibles todos los medios para comunicarse. El diseño se ideó en conjunto con el cliente y los skills que se utilizaron fueron HTML, CSS, JavaScript y React-Vite. Para el Hosting se conectó a Firebase aprovechando su función gratuita ya que es un pequeño negocio local.",
        "descriptionAdministrador":"Esta app busca resolver la planificación de las tareas del técnico de mantenimiento del hotel que antiguamente se le encomendaban con papelitos y fichas impresas. Administrador de tareas está desarrollado con React-Vite. Permite gestionar tareas, marcar como completadas y eliminar. Tambien cuenta con un apartado que permite generar plantillas de todas las habitaciones, piso por piso para que el empleado pueda ir marcando cada habitación que haya terminado. La aplicación utiliza Firebase para el almacenamiento.",
        "descriptionTroqueles":"Este proyecto busca solucionar la organización en la imprenta respecto a los troqueles que usa la máquina de stamping y corte. Ya que los troqueles son muchos, y hay estanterías llenas de ellos, esto optimiza el guardado y buscado respectivamente para cuando se lo necesite. También un problema a la hora de la compra de troqueles era que a veces al tener todo tan desorganizado, no sabían las medidas de los troqueles que ya tenían y a veces se compraban troqueles nuevos con medidas que ya existían. Ahora la empresa se asegura de si existe el stock antes de pedir nuevos. En principio había realizado el desarrollo solamente con JavaScript donde la información se guardaba localmente, ahora se actualizó el programa con React y se conectó en Firebase para que puedan guardar los datos y lograr abrir la aplicación en cualquier dispositivo y no solamente en la computadora local.",
        "descriptionAluraflix":"Proyecto realizado en el bootcamp de Alura Latam, donde se desarrolla una aplicación web para gestionar una lista de películas y series. La aplicación permite a los usuarios agregar nuevas películas o series a la lista, ver detalles de cada una, y eliminar las que ya no desean. Está desarrollado con React y utiliza una API simulada para el almacenamiento de datos.",
        "descriptionGlosario": "Challenge de Alura Latam, que cuenta con un formulario donde el usuario debe ingresar la palabra en español, la palabra en alemán y una url con la imagen. Al apretar en Enviar los datos se almacenan en el archivo json en el server (con API simulada) y muestra una tarjeta en el display con los datos mencionados. Así la persona que esté aprendiendo el idioma puede ir gestionando su aprendizaje de vocabulario. Además el usuario puede buscar tarjetas previamente subidas con una barra de búsqueda y también puede eliminar en el caso que quisiera.",
        "descriptionNumerosecreto": "Juego de adivinar el número realizado en Alura, aplicando lógica con JavaScript. El usuario debe adivinar un número secreto generado aleatoriamente entre 1 y 10. Tiene un total de 3 intentos para acertar el número. Después de cada intento, el juego proporciona retroalimentación indicando si el número ingresado es demasiado alto, demasiado bajo o correcto. Si el usuario adivina el número dentro de los 10 intentos, gana el juego; de lo contrario, pierde y se revela el número secreto.",
        "descriptionOrg":"Proyecto para organizar roles y responsabilidades dentro de un equipo de trabajo. La aplicación permite a los usuarios crear equipos, asignar roles y responsabilidades a cada miembro del equipo, y gestionar las tareas asociadas a cada rol. Está desarrollado con JavaScript, HTML y CSS. La aplicación utiliza LocalStorage para el almacenamiento de datos.",
        "descriptionPpt":"El clásico juego de piedra, papel y tijeras realizado en freeCodeCamp donde ellos nos brindaban la base con html y css, y los estudiantes aplicabamos la lógica con JavaScript para que el juego funcione de manera correcta. El juego permite al usuario seleccionar entre piedra, papel o tijeras, y luego genera una elección aleatoria para la computadora. El resultado del juego se muestra en pantalla, indicando si el usuario ganó, perdió o empató. Además, el juego lleva un registro del puntaje del usuario y de la computadora.",
        "descriptionEncriptador":"Challenge de Alura Latam, donde el usuario ingresa un texto y se lo encripta. A su vez si el usuario ingresa un texto encriptado con este programa, se puede desencriptar. El programa cumple con las siguientes reglas de encriptación: 'e' es convertida para 'enter' 'i' es convertida para 'imes' 'a' es convertida para 'ai' 'o' es convertida para 'ober' 'u' es convertida para 'ufat' Adicionalmente el programa cuenta con un botón que permite copiar el texto encriptado o desencriptado al portapapeles."
    }
}